---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ClearCoverExterior
source: html/305c6fdc-1bb0-0b58-4859-99f5b2335540.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ClearCoverExterior Property

"Rebar Cover - Exterior Face"

## Syntax (C#)
```csharp
public static ForgeTypeId ClearCoverExterior { get; }
```